TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
//###########################################################################
//
// FILE:   pin_map.h
//
// TITLE:  Definitions of pin mux info for gpio.c.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef __PIN_MAP_H__
#define __PIN_MAP_H__

//*****************************************************************************
// 0x00000003 = MUX register value
// 0x0000000C = GMUX register value
// 0x0000FF00 = Shift amount within mux registers
// 0xFFFF0000 = Offset of MUX register
//*****************************************************************************


#define GPIO_0_GPIO0                    0x000C0000U
#define GPIO_0_EPWM1_A                  0x000C0001U
#define GPIO_0_EMIF1_A13                0x000C0002U
#define GPIO_0_EMIF1_D0                 0x000C0003U
#define GPIO_0_MCAND_TX                 0x000C0005U
#define GPIO_0_I2CA_SDA                 0x000C0006U
#define GPIO_0_UARTE_TX                 0x000C0007U
#define GPIO_0_OUTPUTXBAR9              0x000C0009U
#define GPIO_0_ESC_TX0_DATA0            0x000C000AU
#define GPIO_0_ESC_GPI0                 0x000C000BU
#define GPIO_0_FSITXA_D0                0x000C000DU

#define GPIO_1_GPIO1                    0x000C0200U
#define GPIO_1_EPWM1_B                  0x000C0201U
#define GPIO_1_EMIF1_A14                0x000C0202U
#define GPIO_1_EMIF1_D3                 0x000C0203U
#define GPIO_1_MCAND_RX                 0x000C0205U
#define GPIO_1_I2CA_SCL                 0x000C0206U
#define GPIO_1_UARTE_RX                 0x000C0207U
#define GPIO_1_OUTPUTXBAR10             0x000C0209U
#define GPIO_1_ESC_TX1_DATA0            0x000C020AU
#define GPIO_1_ESC_GPI1                 0x000C020BU
#define GPIO_1_FSITXA_D1                0x000C020DU

#define GPIO_2_GPIO2                    0x000C0400U
#define GPIO_2_EPWM2_A                  0x000C0401U
#define GPIO_2_EMIF1_A15                0x000C0402U
#define GPIO_2_EMIF1_D4                 0x000C0403U
#define GPIO_2_UARTA_TX                 0x000C0405U
#define GPIO_2_I2CB_SDA                 0x000C0406U
#define GPIO_2_MCANF_TX                 0x000C0407U
#define GPIO_2_OUTPUTXBAR1              0x000C0409U
#define GPIO_2_ESC_RX1_ERR              0x000C040AU
#define GPIO_2_ESC_GPI2                 0x000C040BU
#define GPIO_2_FSITXA_CLK               0x000C040DU

#define GPIO_3_GPIO3                    0x000C0600U
#define GPIO_3_EPWM2_B                  0x000C0601U
#define GPIO_3_EMIF1_A16                0x000C0602U
#define GPIO_3_EMIF1_D5                 0x000C0603U
#define GPIO_3_UARTA_RX                 0x000C0605U
#define GPIO_3_I2CB_SCL                 0x000C0606U
#define GPIO_3_MCANF_RX                 0x000C0607U
#define GPIO_3_OUTPUTXBAR2              0x000C0609U
#define GPIO_3_ESC_GPI3                 0x000C060BU
#define GPIO_3_FSIRXA_D0                0x000C060DU

#define GPIO_4_GPIO4                    0x000C0800U
#define GPIO_4_EPWM3_A                  0x000C0801U
#define GPIO_4_EMIF1_A17                0x000C0802U
#define GPIO_4_EMIF1_D9                 0x000C0803U
#define GPIO_4_MCANC_TX                 0x000C0805U
#define GPIO_4_UARTF_TX                 0x000C0807U
#define GPIO_4_OUTPUTXBAR3              0x000C0809U
#define GPIO_4_ESC_GPI4                 0x000C080BU
#define GPIO_4_FSIRXA_D1                0x000C080DU
#define GPIO_4_ERRORSTS                 0x000C080FU

#define GPIO_5_GPIO5                    0x000C0A00U
#define GPIO_5_EPWM3_B                  0x000C0A01U
#define GPIO_5_EMIF1_A18                0x000C0A02U
#define GPIO_5_EMIF1_D10                0x000C0A03U
#define GPIO_5_MCANC_RX                 0x000C0A05U
#define GPIO_5_UARTF_RX                 0x000C0A07U
#define GPIO_5_OUTPUTXBAR11             0x000C0A09U
#define GPIO_5_OUTPUTXBAR3              0x000C0A0AU
#define GPIO_5_ESC_GPI5                 0x000C0A0BU
#define GPIO_5_FSIRXA_CLK               0x000C0A0DU

#define GPIO_6_GPIO6                    0x000C0C00U
#define GPIO_6_EPWM4_A                  0x000C0C01U
#define GPIO_6_EMIF1_DQM0               0x000C0C02U
#define GPIO_6_EMIF1_CLK                0x000C0C03U
#define GPIO_6_MCANB_TX                 0x000C0C05U
#define GPIO_6_LINA_TX                  0x000C0C06U
#define GPIO_6_OUTPUTXBAR4              0x000C0C09U
#define GPIO_6_SYNCOUT                  0x000C0C0AU
#define GPIO_6_ESC_GPI6                 0x000C0C0BU
#define GPIO_6_FSITXB_D0                0x000C0C0DU

#define GPIO_7_GPIO7                    0x000C0E00U
#define GPIO_7_EPWM4_B                  0x000C0E01U
#define GPIO_7_EMIF1_DQM1               0x000C0E02U
#define GPIO_7_EMIF1_CAS                0x000C0E03U
#define GPIO_7_MCANB_RX                 0x000C0E05U
#define GPIO_7_LINA_RX                  0x000C0E06U
#define GPIO_7_OUTPUTXBAR5              0x000C0E09U
#define GPIO_7_ESC_GPI7                 0x000C0E0BU
#define GPIO_7_FSITXB_D1                0x000C0E0DU

#define GPIO_8_GPIO8                    0x000C1000U
#define GPIO_8_EPWM5_A                  0x000C1001U
#define GPIO_8_EMIF1_RAS                0x000C1002U
#define GPIO_8_EPWM4_B                  0x000C1003U
#define GPIO_8_MCANC_TX                 0x000C1005U
#define GPIO_8_SPIE_PICO                0x000C1006U
#define GPIO_8_UARTD_TX                 0x000C1007U
#define GPIO_8_OUTPUTXBAR12             0x000C1009U
#define GPIO_8_ADCSOCAO                 0x000C100AU
#define GPIO_8_ESC_GPO0                 0x000C100BU
#define GPIO_8_FSITXB_CLK               0x000C100DU
#define GPIO_8_FSITXA_D1                0x000C100EU
#define GPIO_8_FSIRXA_D0                0x000C100FU

