TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_9_GPIO9                    0x000C1200U
#define GPIO_9_EPWM5_B                  0x000C1201U
#define GPIO_9_EMIF1_D11                0x000C1202U
#define GPIO_9_SPIE_POCI                0x000C1206U
#define GPIO_9_UARTD_RX                 0x000C1207U
#define GPIO_9_OUTPUTXBAR6              0x000C1209U
#define GPIO_9_ESC_TX0_CLK              0x000C120AU
#define GPIO_9_ESC_GPO1                 0x000C120BU
#define GPIO_9_FSIRXB_D0                0x000C120DU
#define GPIO_9_FSITXA_D0                0x000C120EU
#define GPIO_9_FSIRXA_CLK               0x000C120FU

#define GPIO_10_GPIO10                  0x000C1400U
#define GPIO_10_EPWM8_A                 0x000C1401U
#define GPIO_10_PMBUSA_SCL              0x000C1402U
#define GPIO_10_ADCSOCBO                0x000C1403U
#define GPIO_10_MCANC_RX                0x000C1405U
#define GPIO_10_UARTC_TX                0x000C1406U
#define GPIO_10_I2CA_SCL                0x000C1407U
#define GPIO_10_SENT2                   0x000C1409U
#define GPIO_10_ESC_GPI19               0x000C140DU
#define GPIO_10_ADCA_EXTMUXSEL2         0x000C140EU
#define GPIO_10_OUTPUTXBAR13            0x000C140FU

#define GPIO_11_GPIO11                  0x000C1600U
#define GPIO_11_EPWM6_B                 0x000C1601U
#define GPIO_11_EMIF1_D15               0x000C1602U
#define GPIO_11_EPWM7_B                 0x000C1603U
#define GPIO_11_SPIE_PTE                0x000C1606U
#define GPIO_11_SD4_D1                  0x000C1607U
#define GPIO_11_PMBUSA_ALERT            0x000C1609U
#define GPIO_11_ESC_TX0_DATA1           0x000C160AU
#define GPIO_11_ESC_GPO3                0x000C160BU
#define GPIO_11_FSIRXB_CLK              0x000C160DU
#define GPIO_11_FSIRXA_D1               0x000C160EU
#define GPIO_11_OUTPUTXBAR7             0x000C160FU

#define GPIO_12_GPIO12                  0x000C1800U
#define GPIO_12_EPWM7_A                 0x000C1801U
#define GPIO_12_EMIF1_A1                0x000C1802U
#define GPIO_12_ADCSOCAO                0x000C1803U
#define GPIO_12_SPIE_CLK                0x000C1806U
#define GPIO_12_SD4_C2                  0x000C1807U
#define GPIO_12_PMBUSA_CTL              0x000C1809U
#define GPIO_12_ESC_TX0_DATA2           0x000C180AU
#define GPIO_12_ESC_GPO4                0x000C180BU
#define GPIO_12_FSIRXC_D0               0x000C180DU
#define GPIO_12_FSIRXA_D0               0x000C180EU
#define GPIO_12_OUTPUTXBAR14            0x000C180FU

#define GPIO_13_GPIO13                  0x000C1A00U
#define GPIO_13_EPWM7_B                 0x000C1A01U
#define GPIO_13_EMIF1_CS0N              0x000C1A02U
#define GPIO_13_EMIF1_D9                0x000C1A03U
#define GPIO_13_UARTC_RX                0x000C1A06U
#define GPIO_13_SD4_D2                  0x000C1A07U
#define GPIO_13_PMBUSA_SDA              0x000C1A09U
#define GPIO_13_ESC_TX0_DATA3           0x000C1A0AU
#define GPIO_13_ESC_GPO5                0x000C1A0BU
#define GPIO_13_FSIRXC_D1               0x000C1A0DU
#define GPIO_13_FSIRXA_CLK              0x000C1A0EU
#define GPIO_13_OUTPUTXBAR15            0x000C1A0FU

#define GPIO_14_GPIO14                  0x000C1C00U
#define GPIO_14_EPWM6_A                 0x000C1C01U
#define GPIO_14_EMIF1_D17               0x000C1C02U
#define GPIO_14_EPWM18_A                0x000C1C03U
#define GPIO_14_EMIF1_D13               0x000C1C05U
#define GPIO_14_LINA_TX                 0x000C1C06U
#define GPIO_14_OUTPUTXBAR3             0x000C1C07U
#define GPIO_14_PMBUSA_SCL              0x000C1C09U
#define GPIO_14_ESC_PHY1_LINKSTATUS     0x000C1C0AU
#define GPIO_14_ESC_GPO6                0x000C1C0BU
#define GPIO_14_FSIRXC_CLK              0x000C1C0DU
#define GPIO_14_SD4_C1                  0x000C1C0EU
#define GPIO_14_OUTPUTXBAR8             0x000C1C0FU

#define GPIO_15_GPIO15                  0x000C1E00U
#define GPIO_15_EPWM8_B                 0x000C1E01U
#define GPIO_15_PMBUSA_CTL              0x000C1E03U
#define GPIO_15_I2CA_SDA                0x000C1E05U
#define GPIO_15_LINA_RX                 0x000C1E06U
#define GPIO_15_OUTPUTXBAR4             0x000C1E07U
#define GPIO_15_SENT1                   0x000C1E09U
#define GPIO_15_ESC_GPO7                0x000C1E0AU
#define GPIO_15_ESC_GPI20               0x000C1E0DU
#define GPIO_15_ADCA_EXTMUXSEL3         0x000C1E0EU
#define GPIO_15_OUTPUTXBAR16            0x000C1E0FU

#define GPIO_16_GPIO16                  0x00100000U
#define GPIO_16_EPWM9_A                 0x00100001U
#define GPIO_16_EMIF1_D29               0x00100002U
#define GPIO_16_EMIF1_BA0               0x00100003U
#define GPIO_16_SPIA_PICO               0x00100005U
#define GPIO_16_MCAND_TX                0x00100007U
#define GPIO_16_ESC_RX1_CLK             0x0010000AU
#define GPIO_16_SD1_D1                  0x0010000BU
#define GPIO_16_FSIRXD_D1               0x0010000DU
#define GPIO_16_FSIRXC_CLK              0x0010000EU
#define GPIO_16_OUTPUTXBAR7             0x0010000FU

#define GPIO_17_GPIO17                  0x00100200U
#define GPIO_17_EPWM9_B                 0x00100201U
#define GPIO_17_EMIF1_DQM3              0x00100202U
#define GPIO_17_EMIF1_BA1               0x00100203U
#define GPIO_17_SPIA_POCI               0x00100205U
#define GPIO_17_MCAND_RX                0x00100207U
#define GPIO_17_ESC_RX1_DV              0x0010020AU
#define GPIO_17_SD1_C1                  0x0010020BU
#define GPIO_17_FSIRXD_CLK              0x0010020DU
#define GPIO_17_UARTC_TX                0x0010020EU
#define GPIO_17_OUTPUTXBAR8             0x0010020FU

#define GPIO_18_GPIO18                  0x00100400U
#define GPIO_18_EPWM15_A                0x00100401U
#define GPIO_18_PMBUSA_ALERT            0x00100403U
#define GPIO_18_I2CA_SCL                0x00100405U
#define GPIO_18_UARTC_RX                0x00100406U
#define GPIO_18_SENT4                   0x00100409U
#define GPIO_18_ESC_GPI21               0x0010040DU
#define GPIO_18_ADCB_EXTMUXSEL0         0x0010040EU

#define GPIO_19_GPIO19                  0x00100600U
#define GPIO_19_EPWM10_B                0x00100601U
#define GPIO_19_EMIF1_CS3N              0x00100602U
#define GPIO_19_ADCSOCBO                0x00100603U
#define GPIO_19_SPIA_PTE                0x00100605U
#define GPIO_19_UARTE_RX                0x00100606U
#define GPIO_19_MCANC_TX                0x00100607U
#define GPIO_19_PMBUSA_ALERT            0x00100609U
#define GPIO_19_ESC_TX1_DATA3           0x0010060AU
#define GPIO_19_SD1_C2                  0x0010060BU

