TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_20_GPIO20                  0x00100800U
#define GPIO_20_EPWM11_A                0x00100801U
#define GPIO_20_EMIF1_BA0               0x00100802U
#define GPIO_20_EMIF1_DQM2              0x00100803U
#define GPIO_20_SPIC_PICO               0x00100806U
#define GPIO_20_MCANB_RX                0x00100807U
#define GPIO_20_ESC_TX1_DATA2           0x0010080AU
#define GPIO_20_SD1_D3                  0x0010080BU

#define GPIO_21_GPIO21                  0x00100A00U
#define GPIO_21_EPWM11_B                0x00100A01U
#define GPIO_21_EMIF1_BA1               0x00100A02U
#define GPIO_21_SPIC_POCI               0x00100A06U
#define GPIO_21_MCANB_TX                0x00100A07U
#define GPIO_21_ESC_TX1_DATA1           0x00100A0AU
#define GPIO_21_SD1_C3                  0x00100A0BU

#define GPIO_22_GPIO22                  0x00100C00U
#define GPIO_22_EPWM12_A                0x00100C01U
#define GPIO_22_PMBUSA_SDA              0x00100C03U
#define GPIO_22_I2CB_SDA                0x00100C05U
#define GPIO_22_UARTB_TX                0x00100C06U
#define GPIO_22_MCANC_TX                0x00100C07U
#define GPIO_22_SENT5                   0x00100C09U
#define GPIO_22_ESC_GPO2                0x00100C0AU
#define GPIO_22_ESC_GPI22               0x00100C0DU
#define GPIO_22_ADCB_EXTMUXSEL1         0x00100C0EU

#define GPIO_23_GPIO23                  0x00100E00U
#define GPIO_23_EPWM12_B                0x00100E01U
#define GPIO_23_PMBUSA_SCL              0x00100E03U
#define GPIO_23_I2CB_SCL                0x00100E05U
#define GPIO_23_UARTB_RX                0x00100E06U
#define GPIO_23_MCANC_RX                0x00100E07U
#define GPIO_23_SENT6                   0x00100E09U
#define GPIO_23_ESC_PHY_RESETN          0x00100E0AU
#define GPIO_23_ESC_GPI23               0x00100E0DU
#define GPIO_23_ADCC_EXTMUXSEL0         0x00100E0EU

#define GPIO_24_GPIO24                  0x00101000U
#define GPIO_24_EPWM13_A                0x00101001U
#define GPIO_24_EMIF1_DQM0              0x00101002U
#define GPIO_24_SPIB_PICO               0x00101005U
#define GPIO_24_LINB_TX                 0x00101006U
#define GPIO_24_MCANE_TX                0x00101007U
#define GPIO_24_ESC_RX0_CLK             0x0010100AU
#define GPIO_24_SD2_D1                  0x0010100BU
#define GPIO_24_ESC_GPI24               0x0010100DU
#define GPIO_24_EPWM2_A                 0x0010100EU
#define GPIO_24_OUTPUTXBAR1             0x0010100FU

#define GPIO_25_GPIO25                  0x00101200U
#define GPIO_25_EPWM13_B                0x00101201U
#define GPIO_25_EMIF1_DQM1              0x00101202U
#define GPIO_25_SPIB_POCI               0x00101205U
#define GPIO_25_LINB_RX                 0x00101206U
#define GPIO_25_MCANE_RX                0x00101207U
#define GPIO_25_PMBUSA_SDA              0x00101209U
#define GPIO_25_ESC_RX0_DV              0x0010120AU
#define GPIO_25_SD2_C1                  0x0010120BU
#define GPIO_25_FSITXA_D1               0x0010120DU
#define GPIO_25_EPWM2_B                 0x0010120EU
#define GPIO_25_OUTPUTXBAR2             0x0010120FU

#define GPIO_26_GPIO26                  0x00101400U
#define GPIO_26_EPWM14_A                0x00101401U
#define GPIO_26_EMIF1_DQM2              0x00101402U
#define GPIO_26_SPIB_CLK                0x00101405U
#define GPIO_26_UARTE_TX                0x00101406U
#define GPIO_26_MCANE_TX                0x00101407U
#define GPIO_26_PMBUSA_CTL              0x00101409U
#define GPIO_26_ESC_RX0_ERR             0x0010140AU
#define GPIO_26_SD2_D2                  0x0010140BU
#define GPIO_26_FSITXA_D0               0x0010140DU
#define GPIO_26_ESC_MDIO_CLK            0x0010140EU
#define GPIO_26_OUTPUTXBAR3             0x0010140FU

#define GPIO_27_GPIO27                  0x00101600U
#define GPIO_27_EPWM14_B                0x00101601U
#define GPIO_27_EMIF1_DQM3              0x00101602U
#define GPIO_27_SPIB_PTE                0x00101605U
#define GPIO_27_UARTA_TX                0x00101606U
#define GPIO_27_EPWM4_A                 0x00101609U
#define GPIO_27_ESC_RX0_DATA0           0x0010160AU
#define GPIO_27_SD2_C2                  0x0010160BU
#define GPIO_27_FSITXA_CLK              0x0010160DU
#define GPIO_27_ESC_MDIO_DATA           0x0010160EU
#define GPIO_27_OUTPUTXBAR4             0x0010160FU

#define GPIO_28_GPIO28                  0x00101800U
#define GPIO_28_EPWM15_A                0x00101801U
#define GPIO_28_EMIF1_CS4N              0x00101802U
#define GPIO_28_EMIF1_CS2N              0x00101803U
#define GPIO_28_UARTA_RX                0x00101806U
#define GPIO_28_EPWM4_B                 0x00101809U
#define GPIO_28_ESC_RX0_DATA1           0x0010180AU
#define GPIO_28_SD2_D3                  0x0010180BU
#define GPIO_28_OUTPUTXBAR5             0x0010180FU

#define GPIO_29_GPIO29                  0x00101A00U
#define GPIO_29_EPWM15_B                0x00101A01U
#define GPIO_29_PMBUSA_SDA              0x00101A02U
#define GPIO_29_UARTE_RX                0x00101A06U
#define GPIO_29_I2CA_SDA                0x00101A07U
#define GPIO_29_SENT3                   0x00101A09U
#define GPIO_29_ESC_LATCH0              0x00101A0AU
#define GPIO_29_ESC_I2C_SDA             0x00101A0DU
#define GPIO_29_ADCC_EXTMUXSEL1         0x00101A0EU
#define GPIO_29_OUTPUTXBAR6             0x00101A0FU

#define GPIO_30_GPIO30                  0x00101C00U
#define GPIO_30_EPWM16_A                0x00101C01U
#define GPIO_30_EMIF1_CLK               0x00101C02U
#define GPIO_30_EMIF1_CS4N              0x00101C03U
#define GPIO_30_MCANC_RX                0x00101C05U
#define GPIO_30_SPID_PICO               0x00101C06U
#define GPIO_30_EMIF1_A12               0x00101C07U
#define GPIO_30_ESC_LATCH1              0x00101C0AU
#define GPIO_30_SD2_D4                  0x00101C0BU
#define GPIO_30_ESC_I2C_SCL             0x00101C0DU
#define GPIO_30_ESC_SYNC1               0x00101C0EU
#define GPIO_30_OUTPUTXBAR7             0x00101C0FU

#define GPIO_31_GPIO31                  0x00101E00U
#define GPIO_31_EPWM16_B                0x00101E01U
#define GPIO_31_EMIF1_WEN               0x00101E02U
#define GPIO_31_EMIF1_RNW               0x00101E03U
#define GPIO_31_MCANC_TX                0x00101E05U
#define GPIO_31_SPID_POCI               0x00101E06U
#define GPIO_31_I2CA_SDA                0x00101E07U
#define GPIO_31_ESC_RX1_DATA0           0x00101E0AU
#define GPIO_31_SD2_C4                  0x00101E0BU
#define GPIO_31_FSITXD_D0               0x00101E0DU
#define GPIO_31_OUTPUTXBAR8             0x00101E0FU

#define GPIO_32_GPIO32                  0x008C0000U
#define GPIO_32_EMIF1_CS0N              0x008C0002U
#define GPIO_32_EMIF1_OEN               0x008C0003U
#define GPIO_32_SPIA_PICO               0x008C0005U
#define GPIO_32_SPID_CLK                0x008C0006U
#define GPIO_32_I2CA_SDA                0x008C0007U
#define GPIO_32_OUTPUTXBAR9             0x008C0009U
#define GPIO_32_ESC_RX0_DATA0           0x008C000AU

#define GPIO_33_GPIO33                  0x008C0200U
#define GPIO_33_EMIF1_RNW               0x008C0202U
#define GPIO_33_EMIF1_BA0               0x008C0203U
#define GPIO_33_SPIA_POCI               0x008C0205U
#define GPIO_33_SPID_PTE                0x008C0206U
#define GPIO_33_I2CA_SCL                0x008C0207U
#define GPIO_33_OUTPUTXBAR10            0x008C0209U
#define GPIO_33_ESC_LED_ERR             0x008C020AU

