TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_34_GPIO34                  0x008C0400U
#define GPIO_34_EPWM18_A                0x008C0401U
#define GPIO_34_EMIF1_CS2N              0x008C0402U
#define GPIO_34_EMIF1_BA1               0x008C0403U
#define GPIO_34_SPIA_CLK                0x008C0405U
#define GPIO_34_UARTF_TX                0x008C0406U
#define GPIO_34_I2CB_SDA                0x008C0407U
#define GPIO_34_OUTPUTXBAR11            0x008C0409U
#define GPIO_34_ESC_LATCH0              0x008C040AU
#define GPIO_34_EPWM3_B                 0x008C040DU
#define GPIO_34_ESC_SYNC0               0x008C040EU
#define GPIO_34_OUTPUTXBAR1             0x008C040FU

#define GPIO_35_GPIO35                  0x008C0600U
#define GPIO_35_EPWM18_B                0x008C0601U
#define GPIO_35_EMIF1_CS3N              0x008C0602U
#define GPIO_35_EMIF1_A0                0x008C0603U
#define GPIO_35_SPIA_PTE                0x008C0605U
#define GPIO_35_UARTF_RX                0x008C0606U
#define GPIO_35_I2CB_SCL                0x008C0607U
#define GPIO_35_OUTPUTXBAR12            0x008C0609U
#define GPIO_35_ESC_LATCH1              0x008C060AU
#define GPIO_35_ESC_SYNC1               0x008C060EU

#define GPIO_36_GPIO36                  0x008C0800U
#define GPIO_36_EMIF1_WAIT              0x008C0802U
#define GPIO_36_EMIF1_A1                0x008C0803U
#define GPIO_36_UARTC_TX                0x008C0805U
#define GPIO_36_MCANC_RX                0x008C0806U
#define GPIO_36_OUTPUTXBAR13            0x008C0809U
#define GPIO_36_SD1_D1                  0x008C080BU
#define GPIO_36_EMIF1_WEN               0x008C080EU

#define GPIO_37_GPIO37                  0x008C0A00U
#define GPIO_37_EPWM18_A                0x008C0A01U
#define GPIO_37_EMIF1_OEN               0x008C0A02U
#define GPIO_37_EMIF1_A2                0x008C0A03U
#define GPIO_37_UARTC_RX                0x008C0A05U
#define GPIO_37_MCANC_TX                0x008C0A06U
#define GPIO_37_OUTPUTXBAR14            0x008C0A09U
#define GPIO_37_ESC_RX1_DATA1           0x008C0A0AU
#define GPIO_37_SD1_D2                  0x008C0A0BU
#define GPIO_37_EMIF1_D24               0x008C0A0EU
#define GPIO_37_OUTPUTXBAR2             0x008C0A0FU

#define GPIO_38_GPIO38                  0x008C0C00U
#define GPIO_38_EPWM18_B                0x008C0C01U
#define GPIO_38_EMIF1_A0                0x008C0C02U
#define GPIO_38_EMIF1_A3                0x008C0C03U
#define GPIO_38_UARTA_TX                0x008C0C05U
#define GPIO_38_SPIE_PICO               0x008C0C06U
#define GPIO_38_OUTPUTXBAR15            0x008C0C09U
#define GPIO_38_ESC_RX0_DATA1           0x008C0C0AU
#define GPIO_38_SD1_D3                  0x008C0C0BU
#define GPIO_38_FSITXD_D1               0x008C0C0DU
#define GPIO_38_EMIF1_CS2N              0x008C0C0EU

#define GPIO_39_GPIO39                  0x008C0E00U
#define GPIO_39_EMIF1_A1                0x008C0E02U
#define GPIO_39_EMIF1_A4                0x008C0E03U
#define GPIO_39_UARTA_RX                0x008C0E05U
#define GPIO_39_OUTPUTXBAR16            0x008C0E09U
#define GPIO_39_ESC_MDIO_DATA           0x008C0E0AU
#define GPIO_39_SD1_D4                  0x008C0E0BU
#define GPIO_39_FSIRXD_CLK              0x008C0E0DU
#define GPIO_39_ESC_LED_RUN             0x008C0E0FU

#define GPIO_40_GPIO40                  0x008C1000U
#define GPIO_40_EPWM13_A                0x008C1001U
#define GPIO_40_EMIF1_A2                0x008C1002U
#define GPIO_40_MCANB_RX                0x008C1005U
#define GPIO_40_I2CB_SDA                0x008C1006U
#define GPIO_40_OUTPUTXBAR9             0x008C1009U
#define GPIO_40_ESC_GPO2                0x008C100AU
#define GPIO_40_SD4_C3                  0x008C100BU
#define GPIO_40_EPWM1_A                 0x008C100EU
#define GPIO_40_SD2_C1                  0x008C100FU

#define GPIO_41_GPIO41                  0x008C1200U
#define GPIO_41_EPWM13_B                0x008C1201U
#define GPIO_41_EMIF1_A3                0x008C1202U
#define GPIO_41_EPWM18_A                0x008C1203U
#define GPIO_41_MCANB_TX                0x008C1205U
#define GPIO_41_SPIE_POCI               0x008C1206U
#define GPIO_41_I2CB_SCL                0x008C1207U
#define GPIO_41_OUTPUTXBAR10            0x008C1209U
#define GPIO_41_ESC_RX0_DATA2           0x008C120AU
#define GPIO_41_SD4_D3                  0x008C120BU
#define GPIO_41_FSIRXD_CLK              0x008C120DU
#define GPIO_41_EPWM1_B                 0x008C120EU
#define GPIO_41_SD2_D1                  0x008C120FU

#define GPIO_42_GPIO42                  0x008C1400U
#define GPIO_42_EPWM14_A                0x008C1401U
#define GPIO_42_EMIF1_A2                0x008C1402U
#define GPIO_42_EMIF1_A13               0x008C1403U
#define GPIO_42_UARTA_TX                0x008C1405U
#define GPIO_42_SPIE_CLK                0x008C1406U
#define GPIO_42_I2CA_SDA                0x008C1407U
#define GPIO_42_OUTPUTXBAR13            0x008C1409U
#define GPIO_42_SD4_C3                  0x008C140AU
#define GPIO_42_SD4_C4                  0x008C140BU
#define GPIO_42_FSIRXD_D0               0x008C140DU
#define GPIO_42_ADCE_EXTMUXSEL2         0x008C140EU

#define GPIO_43_GPIO43                  0x008C1600U
#define GPIO_43_EPWM14_B                0x008C1601U
#define GPIO_43_EMIF1_A4                0x008C1602U
#define GPIO_43_EMIF1_D13               0x008C1603U
#define GPIO_43_UARTA_RX                0x008C1605U
#define GPIO_43_SPIE_PTE                0x008C1606U
#define GPIO_43_I2CA_SCL                0x008C1607U
#define GPIO_43_OUTPUTXBAR14            0x008C1609U
#define GPIO_43_SD4_D4                  0x008C160BU
#define GPIO_43_FSIRXD_D1               0x008C160DU
#define GPIO_43_ADCE_EXTMUXSEL3         0x008C160EU

#define GPIO_44_GPIO44                  0x008C1800U
#define GPIO_44_EMIF1_A4                0x008C1802U
#define GPIO_44_SPID_POCI               0x008C1805U
#define GPIO_44_MCANB_RX                0x008C1806U
#define GPIO_44_UARTB_TX                0x008C1807U
#define GPIO_44_OUTPUTXBAR14            0x008C1809U
#define GPIO_44_ESC_TX1_CLK             0x008C180AU
#define GPIO_44_SD3_C4                  0x008C180BU
#define GPIO_44_FSIRXD_CLK              0x008C180DU

#define GPIO_45_GPIO45                  0x008C1A00U
#define GPIO_45_EMIF1_A5                0x008C1A02U
#define GPIO_45_SPID_PTE                0x008C1A05U
#define GPIO_45_MCANB_TX                0x008C1A06U
#define GPIO_45_UARTB_RX                0x008C1A07U
#define GPIO_45_OUTPUTXBAR15            0x008C1A09U
#define GPIO_45_ESC_TX1_ENA             0x008C1A0AU
#define GPIO_45_SD3_D4                  0x008C1A0BU
#define GPIO_45_FSIRXD_D0               0x008C1A0DU

#define GPIO_46_GPIO46                  0x008C1C00U
#define GPIO_46_EPWM4_A                 0x008C1C01U
#define GPIO_46_EMIF1_A6                0x008C1C02U
#define GPIO_46_EPWM14_A                0x008C1C03U
#define GPIO_46_UARTC_TX                0x008C1C05U
#define GPIO_46_MCANE_TX                0x008C1C07U
#define GPIO_46_ESC_MDIO_CLK            0x008C1C0AU
#define GPIO_46_SD3_C4                  0x008C1C0BU

#define GPIO_47_GPIO47                  0x008C1E00U
#define GPIO_47_EPWM4_B                 0x008C1E01U
#define GPIO_47_EMIF1_A7                0x008C1E02U
#define GPIO_47_EPWM14_B                0x008C1E03U
#define GPIO_47_UARTC_RX                0x008C1E05U
#define GPIO_47_MCANE_RX                0x008C1E07U
#define GPIO_47_ESC_MDIO_DATA           0x008C1E0AU
#define GPIO_47_SD4_C3                  0x008C1E0BU

#define GPIO_48_GPIO48                  0x00900000U
#define GPIO_48_EMIF1_A8                0x00900002U
#define GPIO_48_UARTD_TX                0x00900005U
#define GPIO_48_OUTPUTXBAR3             0x00900009U
#define GPIO_48_ESC_PHY_CLK             0x0090000AU
#define GPIO_48_SD1_D1                  0x0090000BU
#define GPIO_48_EPWM3_A                 0x0090000DU
#define GPIO_48_SD2_C2                  0x0090000FU

#define GPIO_49_GPIO49                  0x00900200U
#define GPIO_49_EMIF1_A9                0x00900202U
#define GPIO_49_EMIF1_A5                0x00900203U
#define GPIO_49_UARTD_RX                0x00900205U
#define GPIO_49_OUTPUTXBAR4             0x00900209U
#define GPIO_49_ESC_TX1_DATA2           0x0090020AU
#define GPIO_49_SD1_C1                  0x0090020BU
#define GPIO_49_FSITXA_D0               0x0090020DU
#define GPIO_49_SD2_D1                  0x0090020FU

