TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_50_GPIO50                  0x00900400U
#define GPIO_50_EPWM15_A                0x00900401U
#define GPIO_50_EMIF1_A10               0x00900402U
#define GPIO_50_EMIF1_A6                0x00900403U
#define GPIO_50_SPIC_PICO               0x00900406U
#define GPIO_50_MCANF_TX                0x00900407U
#define GPIO_50_ESC_TX1_DATA1           0x0090040AU
#define GPIO_50_SD1_D2                  0x0090040BU
#define GPIO_50_FSITXA_D1               0x0090040DU
#define GPIO_50_ESC_GPI25               0x0090040EU
#define GPIO_50_SD2_D2                  0x0090040FU

#define GPIO_51_GPIO51                  0x00900600U
#define GPIO_51_EPWM15_B                0x00900601U
#define GPIO_51_EMIF1_A11               0x00900602U
#define GPIO_51_EMIF1_A7                0x00900603U
#define GPIO_51_SPIC_POCI               0x00900606U
#define GPIO_51_MCANF_RX                0x00900607U
#define GPIO_51_ESC_TX1_CLK             0x0090060AU
#define GPIO_51_SD1_C2                  0x0090060BU
#define GPIO_51_FSITXA_CLK              0x0090060DU
#define GPIO_51_ESC_GPI26               0x0090060EU
#define GPIO_51_SD2_D3                  0x0090060FU

#define GPIO_52_GPIO52                  0x00900800U
#define GPIO_52_EPWM16_A                0x00900801U
#define GPIO_52_EMIF1_A12               0x00900802U
#define GPIO_52_EMIF1_A8                0x00900803U
#define GPIO_52_UARTD_TX                0x00900805U
#define GPIO_52_SPIC_CLK                0x00900806U
#define GPIO_52_ESC_TX1_ENA             0x0090080AU
#define GPIO_52_SD1_D3                  0x0090080BU
#define GPIO_52_FSIRXA_D0               0x0090080DU
#define GPIO_52_SD2_D4                  0x0090080FU

#define GPIO_53_GPIO53                  0x00900A00U
#define GPIO_53_EPWM16_B                0x00900A01U
#define GPIO_53_EMIF1_D31               0x00900A02U
#define GPIO_53_EMIF1_A9                0x00900A03U
#define GPIO_53_UARTD_RX                0x00900A05U
#define GPIO_53_SPIC_PTE                0x00900A06U
#define GPIO_53_ESC_PHY0_LINKSTATUS     0x00900A0AU
#define GPIO_53_SD1_C3                  0x00900A0BU
#define GPIO_53_FSIRXA_D1               0x00900A0DU
#define GPIO_53_ESC_GPI28               0x00900A0EU
#define GPIO_53_SD1_C1                  0x00900A0FU

#define GPIO_54_GPIO54                  0x00900C00U
#define GPIO_54_EMIF1_D30               0x00900C02U
#define GPIO_54_EMIF1_A10               0x00900C03U
#define GPIO_54_SPIA_PICO               0x00900C05U
#define GPIO_54_ESC_PHY_CLK             0x00900C0AU
#define GPIO_54_SD1_D4                  0x00900C0BU
#define GPIO_54_FSIRXA_CLK              0x00900C0DU
#define GPIO_54_ESC_GPI29               0x00900C0EU
#define GPIO_54_SD1_C2                  0x00900C0FU

#define GPIO_55_GPIO55                  0x00900E00U
#define GPIO_55_EPWM16_B                0x00900E01U
#define GPIO_55_EMIF1_D29               0x00900E02U
#define GPIO_55_EMIF1_D0                0x00900E03U
#define GPIO_55_SPIA_POCI               0x00900E05U
#define GPIO_55_EMIF1_WAIT              0x00900E06U
#define GPIO_55_ESC_PHY0_LINKSTATUS     0x00900E0AU
#define GPIO_55_SD1_C4                  0x00900E0BU
#define GPIO_55_FSITXB_D0               0x00900E0DU
#define GPIO_55_SD1_C3                  0x00900E0FU

#define GPIO_56_GPIO56                  0x00901000U
#define GPIO_56_EPWM17_A                0x00901001U
#define GPIO_56_EMIF1_D28               0x00901002U
#define GPIO_56_EMIF1_D1                0x00901003U
#define GPIO_56_SPIA_CLK                0x00901005U
#define GPIO_56_MCAND_TX                0x00901006U
#define GPIO_56_I2CA_SDA                0x00901007U
#define GPIO_56_ESC_PDI_UC_IRQ          0x0090100AU
#define GPIO_56_SD2_D1                  0x0090100BU
#define GPIO_56_FSITXB_CLK              0x0090100DU
#define GPIO_56_ESC_GPI30               0x0090100EU
#define GPIO_56_SD1_C4                  0x0090100FU

#define GPIO_57_GPIO57                  0x00901200U
#define GPIO_57_EPWM17_B                0x00901201U
#define GPIO_57_EMIF1_D27               0x00901202U
#define GPIO_57_EMIF1_D2                0x00901203U
#define GPIO_57_SPIA_PTE                0x00901205U
#define GPIO_57_MCAND_RX                0x00901206U
#define GPIO_57_I2CA_SCL                0x00901207U
#define GPIO_57_ESC_MDIO_DATA           0x0090120AU
#define GPIO_57_SD2_C1                  0x0090120BU
#define GPIO_57_FSITXB_D1               0x0090120DU
#define GPIO_57_ESC_GPI31               0x0090120EU
#define GPIO_57_SD3_D3                  0x0090120FU

#define GPIO_58_GPIO58                  0x00901400U
#define GPIO_58_EPWM13_A                0x00901401U
#define GPIO_58_EMIF1_D26               0x00901402U
#define GPIO_58_EPWM8_A                 0x00901403U
#define GPIO_58_SPIA_PICO               0x00901405U
#define GPIO_58_MCANC_RX                0x00901407U
#define GPIO_58_SENT1                   0x00901409U
#define GPIO_58_ESC_LED_LINK0_ACTIVE    0x0090140AU
#define GPIO_58_SD2_D2                  0x0090140BU
#define GPIO_58_FSIRXB_D0               0x0090140DU
#define GPIO_58_ESC_TX0_DATA3           0x0090140EU
#define GPIO_58_SD2_C2                  0x0090140FU

#define GPIO_59_GPIO59                  0x00901600U
#define GPIO_59_EPWM5_A                 0x00901601U
#define GPIO_59_EMIF1_D25               0x00901602U
#define GPIO_59_EPWM8_B                 0x00901603U
#define GPIO_59_SPIA_POCI               0x00901605U
#define GPIO_59_MCANC_TX                0x00901607U
#define GPIO_59_SENT2                   0x00901609U
#define GPIO_59_ESC_LED_LINK1_ACTIVE    0x0090160AU
#define GPIO_59_SD2_C2                  0x0090160BU
#define GPIO_59_FSIRXB_D1               0x0090160DU
#define GPIO_59_ESC_TX0_ENA             0x0090160EU
#define GPIO_59_SD2_C3                  0x0090160FU

#define GPIO_60_GPIO60                  0x00901800U
#define GPIO_60_EPWM3_B                 0x00901801U
#define GPIO_60_EMIF1_D24               0x00901802U
#define GPIO_60_EMIF1_D0                0x00901803U
#define GPIO_60_SPIA_CLK                0x00901805U
#define GPIO_60_OUTPUTXBAR3             0x00901806U
#define GPIO_60_SENT3                   0x00901809U
#define GPIO_60_ESC_LED_ERR             0x0090180AU
#define GPIO_60_ESC_LATCH0              0x0090180BU
#define GPIO_60_FSIRXB_CLK              0x0090180DU
#define GPIO_60_SD2_C4                  0x0090180FU

#define GPIO_61_GPIO61                  0x00901A00U
#define GPIO_61_EPWM17_B                0x00901A01U
#define GPIO_61_EMIF1_D23               0x00901A02U
#define GPIO_61_EMIF1_D6                0x00901A03U
#define GPIO_61_SPIA_PTE                0x00901A05U
#define GPIO_61_MCANC_RX                0x00901A07U
#define GPIO_61_OUTPUTXBAR4             0x00901A09U
#define GPIO_61_ESC_LED_RUN             0x00901A0AU
#define GPIO_61_SD2_C3                  0x00901A0BU
#define GPIO_61_FSITXD_CLK              0x00901A0DU
#define GPIO_61_ESC_LATCH1              0x00901A0EU

#define GPIO_62_GPIO62                  0x00901C00U
#define GPIO_62_EPWM17_A                0x00901C01U
#define GPIO_62_EMIF1_D22               0x00901C02U
#define GPIO_62_EMIF1_D7                0x00901C03U
#define GPIO_62_MCANC_RX                0x00901C06U
#define GPIO_62_MCANC_TX                0x00901C07U
#define GPIO_62_SENT4                   0x00901C09U
#define GPIO_62_ESC_LED_STATE_RUN       0x00901C0AU
#define GPIO_62_SD2_D4                  0x00901C0BU
#define GPIO_62_FSITXD_D0               0x00901C0DU
#define GPIO_62_ESC_MDIO_CLK            0x00901C0EU

#define GPIO_63_GPIO63                  0x00901E00U
#define GPIO_63_EPWM9_A                 0x00901E01U
#define GPIO_63_EMIF1_D21               0x00901E02U
#define GPIO_63_EMIF1_RNW               0x00901E03U
#define GPIO_63_SPIB_PICO               0x00901E05U
#define GPIO_63_MCANC_TX                0x00901E06U
#define GPIO_63_SENT5                   0x00901E09U
#define GPIO_63_ESC_RX1_DATA0           0x00901E0AU
#define GPIO_63_SD1_D1                  0x00901E0BU
#define GPIO_63_FSITXD_D1               0x00901E0DU
#define GPIO_63_ADCD_EXTMUXSEL0         0x00901E0EU
#define GPIO_63_SD2_C4                  0x00901E0FU

#define GPIO_64_GPIO64                  0x010C0000U
#define GPIO_64_EPWM9_B                 0x010C0001U
#define GPIO_64_EMIF1_D20               0x010C0002U
#define GPIO_64_EMIF1_WAIT              0x010C0003U
#define GPIO_64_SPIB_POCI               0x010C0005U
#define GPIO_64_MCANA_TX                0x010C0006U
#define GPIO_64_UARTF_TX                0x010C0007U
#define GPIO_64_SENT6                   0x010C0009U
#define GPIO_64_ESC_RX1_DATA1           0x010C000AU
#define GPIO_64_SD1_C1                  0x010C000BU
#define GPIO_64_FSITXD_CLK              0x010C000DU
#define GPIO_64_ADCD_EXTMUXSEL1         0x010C000EU

#define GPIO_65_GPIO65                  0x010C0200U
#define GPIO_65_EPWM10_A                0x010C0201U
#define GPIO_65_EMIF1_D19               0x010C0202U
#define GPIO_65_EMIF1_WEN               0x010C0203U
#define GPIO_65_SPIB_CLK                0x010C0205U
#define GPIO_65_MCANA_RX                0x010C0206U
#define GPIO_65_UARTF_RX                0x010C0207U
#define GPIO_65_ESC_RX1_DATA2           0x010C020AU
#define GPIO_65_SD1_D2                  0x010C020BU
#define GPIO_65_FSITXB_CLK              0x010C020DU
#define GPIO_65_ADCD_EXTMUXSEL2         0x010C020EU
#define GPIO_65_ESC_GPI13               0x010C020FU

#define GPIO_66_GPIO66                  0x010C0400U
#define GPIO_66_EPWM10_B                0x010C0401U
#define GPIO_66_EMIF1_D18               0x010C0402U
#define GPIO_66_EMIF1_OEN               0x010C0403U
#define GPIO_66_SPIB_PTE                0x010C0405U
#define GPIO_66_I2CB_SDA                0x010C0406U
#define GPIO_66_ESC_RX1_DATA3           0x010C040AU
#define GPIO_66_SD1_C2                  0x010C040BU
#define GPIO_66_FSITXB_D1               0x010C040DU
#define GPIO_66_ADCD_EXTMUXSEL3         0x010C040EU
#define GPIO_66_ESC_GPI14               0x010C040FU

#define GPIO_67_GPIO67                  0x010C0600U
#define GPIO_67_EPWM17_A                0x010C0601U
#define GPIO_67_EMIF1_D17               0x010C0602U
#define GPIO_67_LINB_TX                 0x010C0605U
#define GPIO_67_MCAND_TX                0x010C0606U
#define GPIO_67_SD1_D3                  0x010C060BU
#define GPIO_67_FSITXB_CLK              0x010C060DU

#define GPIO_68_GPIO68                  0x010C0800U
#define GPIO_68_EPWM17_B                0x010C0801U
#define GPIO_68_EMIF1_D16               0x010C0802U
#define GPIO_68_EMIF1_D4                0x010C0803U
#define GPIO_68_LINB_RX                 0x010C0805U
#define GPIO_68_MCAND_RX                0x010C0806U
#define GPIO_68_EMIF1_D13               0x010C0807U
#define GPIO_68_ESC_PHY1_LINKSTATUS     0x010C080AU
#define GPIO_68_SD1_C3                  0x010C080BU
#define GPIO_68_FSIRXB_D1               0x010C080DU
#define GPIO_68_ESC_GPI15               0x010C080FU

