TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_69_GPIO69                  0x010C0A00U
#define GPIO_69_EPWM11_A                0x010C0A01U
#define GPIO_69_EMIF1_D15               0x010C0A02U
#define GPIO_69_SPIC_PICO               0x010C0A05U
#define GPIO_69_I2CB_SCL                0x010C0A06U
#define GPIO_69_ESC_RX1_CLK             0x010C0A0AU
#define GPIO_69_SD1_D4                  0x010C0A0BU
#define GPIO_69_FSITXB_D0               0x010C0A0DU

#define GPIO_70_GPIO70                  0x010C0C00U
#define GPIO_70_EPWM11_B                0x010C0C01U
#define GPIO_70_EMIF1_D14               0x010C0C02U
#define GPIO_70_SPIC_POCI               0x010C0C05U
#define GPIO_70_MCANC_RX                0x010C0C06U
#define GPIO_70_UARTB_TX                0x010C0C07U
#define GPIO_70_ESC_RX1_DV              0x010C0C0AU
#define GPIO_70_SD1_C4                  0x010C0C0BU
#define GPIO_70_FSIRXB_D0               0x010C0C0DU
#define GPIO_70_ESC_GPI16               0x010C0C0FU

#define GPIO_71_GPIO71                  0x010C0E00U
#define GPIO_71_EPWM12_A                0x010C0E01U
#define GPIO_71_EPWM11_A                0x010C0E02U
#define GPIO_71_EMIF1_D5                0x010C0E03U
#define GPIO_71_SPIC_CLK                0x010C0E05U
#define GPIO_71_MCANC_TX                0x010C0E06U
#define GPIO_71_UARTB_RX                0x010C0E07U
#define GPIO_71_EMIF1_D13               0x010C0E09U
#define GPIO_71_ESC_RX1_ERR             0x010C0E0AU
#define GPIO_71_SD3_D1                  0x010C0E0BU
#define GPIO_71_FSITXC_CLK              0x010C0E0DU
#define GPIO_71_FSITXB_D0               0x010C0E0EU

#define GPIO_72_GPIO72                  0x010C1000U
#define GPIO_72_EPWM12_B                0x010C1001U
#define GPIO_72_EMIF1_D12               0x010C1002U
#define GPIO_72_SPIC_PTE                0x010C1005U
#define GPIO_72_MCANB_RX                0x010C1006U
#define GPIO_72_UARTA_TX                0x010C1007U
#define GPIO_72_OUTPUTXBAR8             0x010C1009U
#define GPIO_72_ESC_TX1_DATA3           0x010C100AU
#define GPIO_72_SD3_D2                  0x010C100BU
#define GPIO_72_FSITXC_D0               0x010C100DU
#define GPIO_72_SD3_C1                  0x010C100EU

#define GPIO_73_GPIO73                  0x010C1200U
#define GPIO_73_EPWM5_B                 0x010C1201U
#define GPIO_73_EMIF1_D11               0x010C1202U
#define GPIO_73_XCLKOUT                 0x010C1203U
#define GPIO_73_MCANB_TX                0x010C1206U
#define GPIO_73_UARTA_RX                0x010C1207U
#define GPIO_73_OUTPUTXBAR6             0x010C1209U
#define GPIO_73_ESC_TX1_DATA2           0x010C120AU
#define GPIO_73_SD4_D4                  0x010C120BU
#define GPIO_73_FSITXC_CLK              0x010C120DU
#define GPIO_73_SD2_D2                  0x010C120EU

#define GPIO_74_GPIO74                  0x010C1400U
#define GPIO_74_EPWM8_A                 0x010C1401U
#define GPIO_74_EMIF1_D10               0x010C1402U
#define GPIO_74_MCANC_TX                0x010C1406U
#define GPIO_74_ESC_TX1_DATA1           0x010C140AU
#define GPIO_74_SD1_D4                  0x010C140BU
#define GPIO_74_FSITXA_D0               0x010C140DU
#define GPIO_74_SD2_C2                  0x010C140EU

#define GPIO_75_GPIO75                  0x010C1600U
#define GPIO_75_EPWM8_B                 0x010C1601U
#define GPIO_75_EMIF1_D9                0x010C1602U
#define GPIO_75_SPID_CLK                0x010C1605U
#define GPIO_75_MCANC_RX                0x010C1606U
#define GPIO_75_OUTPUTXBAR16            0x010C1609U
#define GPIO_75_ESC_TX1_DATA0           0x010C160AU
#define GPIO_75_SD2_D3                  0x010C160EU

#define GPIO_76_GPIO76                  0x010C1800U
#define GPIO_76_EPWM9_A                 0x010C1801U
#define GPIO_76_EMIF1_D8                0x010C1802U
#define GPIO_76_UARTD_TX                0x010C1805U
#define GPIO_76_MCANE_TX                0x010C1807U
#define GPIO_76_SD4_D4                  0x010C1809U
#define GPIO_76_ESC_PHY_RESETN          0x010C180AU
#define GPIO_76_SD3_C1                  0x010C180BU
#define GPIO_76_FSIRXC_D0               0x010C180DU
#define GPIO_76_SD2_C3                  0x010C180EU
#define GPIO_76_ESC_GPI17               0x010C180FU

#define GPIO_77_GPIO77                  0x010C1A00U
#define GPIO_77_EPWM9_B                 0x010C1A01U
#define GPIO_77_EMIF1_D7                0x010C1A02U
#define GPIO_77_UARTD_RX                0x010C1A05U
#define GPIO_77_MCANE_RX                0x010C1A07U
#define GPIO_77_SD1_D4                  0x010C1A09U
#define GPIO_77_ESC_RX0_CLK             0x010C1A0AU
#define GPIO_77_SD3_D1                  0x010C1A0BU
#define GPIO_77_FSITXB_D0               0x010C1A0DU
#define GPIO_77_SD2_D4                  0x010C1A0EU

#define GPIO_78_GPIO78                  0x010C1C00U
#define GPIO_78_EPWM10_A                0x010C1C01U
#define GPIO_78_EMIF1_D6                0x010C1C02U
#define GPIO_78_EPWM11_A                0x010C1C03U
#define GPIO_78_MCANF_TX                0x010C1C07U
#define GPIO_78_SD4_D4                  0x010C1C09U
#define GPIO_78_ESC_RX0_DV              0x010C1C0AU
#define GPIO_78_SD3_C2                  0x010C1C0BU
#define GPIO_78_FSITXC_D1               0x010C1C0DU
#define GPIO_78_SD2_C4                  0x010C1C0EU
#define GPIO_78_ESC_GPI18               0x010C1C0FU

#define GPIO_79_GPIO79                  0x010C1E00U
#define GPIO_79_EPWM10_B                0x010C1E01U
#define GPIO_79_EMIF1_D5                0x010C1E02U
#define GPIO_79_ERRORSTS                0x010C1E05U
#define GPIO_79_ESC_RX0_ERR             0x010C1E0AU
#define GPIO_79_SD3_D2                  0x010C1E0BU
#define GPIO_79_FSITXC_D0               0x010C1E0DU
#define GPIO_79_SD2_D1                  0x010C1E0EU

#define GPIO_80_GPIO80                  0x01100000U
#define GPIO_80_EPWM11_A                0x01100001U
#define GPIO_80_EMIF1_D4                0x01100002U
#define GPIO_80_ERRORSTS                0x01100005U
#define GPIO_80_SD1_D4                  0x01100009U
#define GPIO_80_ESC_RX0_DATA0           0x0110000AU
#define GPIO_80_SD3_C3                  0x0110000BU
#define GPIO_80_SD2_C1                  0x0110000EU

