TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_81_GPIO81                  0x01100200U
#define GPIO_81_EPWM11_B                0x01100201U
#define GPIO_81_EMIF1_D3                0x01100202U
#define GPIO_81_ESC_RX0_DATA1           0x0110020AU
#define GPIO_81_SD3_D3                  0x0110020BU

#define GPIO_82_GPIO82                  0x01100400U
#define GPIO_82_EPWM12_A                0x01100401U
#define GPIO_82_EMIF1_D2                0x01100402U
#define GPIO_82_ESC_RX0_DATA2           0x0110040AU
#define GPIO_82_SD3_C2                  0x0110040BU

#define GPIO_83_GPIO83                  0x01100600U
#define GPIO_83_EPWM12_B                0x01100601U
#define GPIO_83_EMIF1_D1                0x01100602U
#define GPIO_83_ESC_RX0_DATA3           0x0110060AU
#define GPIO_83_SD3_D2                  0x0110060BU

#define GPIO_84_GPIO84                  0x01100800U
#define GPIO_84_EPWM12_B                0x01100801U
#define GPIO_84_EMIF1_D1                0x01100802U
#define GPIO_84_EMIF1_CS4N              0x01100803U
#define GPIO_84_SPIC_PICO               0x01100805U
#define GPIO_84_UARTA_TX                0x01100806U
#define GPIO_84_MCANF_RX                0x01100807U
#define GPIO_84_ESC_TX0_ENA             0x0110080AU
#define GPIO_84_SD3_C2                  0x0110080BU
#define GPIO_84_FSITXC_D1               0x0110080DU
#define GPIO_84_ESC_RX0_DATA3           0x0110080EU
#define GPIO_84_ESC_GPO24               0x0110080FU

#define GPIO_85_GPIO85                  0x01100A00U
#define GPIO_85_EPWM13_A                0x01100A01U
#define GPIO_85_EMIF1_D0                0x01100A02U
#define GPIO_85_UARTA_RX                0x01100A06U
#define GPIO_85_EMIF1_DQM2              0x01100A09U
#define GPIO_85_ESC_TX0_CLK             0x01100A0AU
#define GPIO_85_SD3_D3                  0x01100A0BU

#define GPIO_86_GPIO86                  0x01100C00U
#define GPIO_86_EPWM13_B                0x01100C01U
#define GPIO_86_EMIF1_A13               0x01100C02U
#define GPIO_86_EMIF1_CAS               0x01100C03U
#define GPIO_86_UARTD_TX                0x01100C06U
#define GPIO_86_ESC_PHY0_LINKSTATUS     0x01100C0AU
#define GPIO_86_SD3_C3                  0x01100C0BU

#define GPIO_87_GPIO87                  0x01100E00U
#define GPIO_87_EPWM14_A                0x01100E01U
#define GPIO_87_EMIF1_A14               0x01100E02U
#define GPIO_87_EMIF1_RAS               0x01100E03U
#define GPIO_87_UARTD_RX                0x01100E06U
#define GPIO_87_EMIF1_DQM3              0x01100E09U
#define GPIO_87_ESC_TX0_DATA0           0x01100E0AU
#define GPIO_87_SD3_D4                  0x01100E0BU

#define GPIO_88_GPIO88                  0x01101000U
#define GPIO_88_EPWM14_B                0x01101001U
#define GPIO_88_EMIF1_A15               0x01101002U
#define GPIO_88_EMIF1_DQM0              0x01101003U
#define GPIO_88_EMIF1_DQM1              0x01101009U
#define GPIO_88_ESC_TX0_DATA1           0x0110100AU
#define GPIO_88_SD3_C4                  0x0110100BU

#define GPIO_89_GPIO89                  0x01101200U
#define GPIO_89_EPWM15_A                0x01101201U
#define GPIO_89_EMIF1_A16               0x01101202U
#define GPIO_89_EMIF1_DQM1              0x01101203U
#define GPIO_89_SPID_PTE                0x01101205U
#define GPIO_89_EMIF1_CAS               0x01101209U
#define GPIO_89_ESC_TX0_DATA2           0x0110120AU
#define GPIO_89_SD1_D3                  0x0110120BU
#define GPIO_89_SD4_D1                  0x0110120EU

#define GPIO_90_GPIO90                  0x01101400U
#define GPIO_90_EPWM15_B                0x01101401U
#define GPIO_90_EMIF1_A17               0x01101402U
#define GPIO_90_EMIF1_DQM2              0x01101403U
#define GPIO_90_SPID_CLK                0x01101405U
#define GPIO_90_EMIF1_RAS               0x01101409U
#define GPIO_90_ESC_TX0_DATA3           0x0110140AU
#define GPIO_90_SD1_C3                  0x0110140BU
#define GPIO_90_SD4_C1                  0x0110140EU

#define GPIO_91_GPIO91                  0x01101600U
#define GPIO_91_EPWM16_A                0x01101601U
#define GPIO_91_EMIF1_A18               0x01101602U
#define GPIO_91_EMIF1_DQM3              0x01101603U
#define GPIO_91_SPID_PICO               0x01101605U
#define GPIO_91_I2CA_SDA                0x01101606U
#define GPIO_91_MCAND_TX                0x01101607U
#define GPIO_91_EMIF1_DQM2              0x01101609U
#define GPIO_91_SD4_D2                  0x0110160BU
#define GPIO_91_OUTPUTXBAR9             0x0110160EU

#define GPIO_92_GPIO92                  0x01101800U
#define GPIO_92_EPWM16_B                0x01101801U
#define GPIO_92_EMIF1_A19               0x01101802U
#define GPIO_92_EMIF1_BA1               0x01101803U
#define GPIO_92_SPID_POCI               0x01101805U
#define GPIO_92_I2CA_SCL                0x01101806U
#define GPIO_92_MCAND_RX                0x01101807U
#define GPIO_92_EMIF1_DQM0              0x01101809U
#define GPIO_92_FSIRXD_CLK              0x0110180AU
#define GPIO_92_SD4_C2                  0x0110180BU
#define GPIO_92_OUTPUTXBAR10            0x0110180EU

#define GPIO_93_GPIO93                  0x01101A00U
#define GPIO_93_EPWM17_A                0x01101A01U
#define GPIO_93_EMIF1_A20               0x01101A02U
#define GPIO_93_EMIF1_BA0               0x01101A03U
#define GPIO_93_SPID_CLK                0x01101A05U
#define GPIO_93_ESC_TX1_CLK             0x01101A0AU
#define GPIO_93_SD4_D3                  0x01101A0BU
#define GPIO_93_OUTPUTXBAR11            0x01101A0EU

#define GPIO_94_GPIO94                  0x01101C00U
#define GPIO_94_EPWM17_B                0x01101C01U
#define GPIO_94_EMIF1_A21               0x01101C02U
#define GPIO_94_SPID_PTE                0x01101C05U
#define GPIO_94_EMIF1_BA1               0x01101C09U
#define GPIO_94_ESC_TX1_ENA             0x01101C0AU
#define GPIO_94_SD4_C3                  0x01101C0BU
#define GPIO_94_OUTPUTXBAR12            0x01101C0EU

#define GPIO_95_GPIO95                  0x01101E00U
#define GPIO_95_EPWM18_A                0x01101E01U
#define GPIO_95_ESC_GPO10               0x01101E0AU
#define GPIO_95_SD1_D1                  0x01101E0BU
#define GPIO_95_OUTPUTXBAR13            0x01101E0EU

#define GPIO_96_GPIO96                  0x018C0000U
#define GPIO_96_EPWM18_B                0x018C0001U
#define GPIO_96_ESC_GPO11               0x018C000AU
#define GPIO_96_SD1_C1                  0x018C000BU
#define GPIO_96_OUTPUTXBAR14            0x018C000EU

#define GPIO_97_GPIO97                  0x018C0200U
#define GPIO_97_ESC_GPI17               0x018C020AU
#define GPIO_97_SD1_D2                  0x018C020BU
#define GPIO_97_OUTPUTXBAR15            0x018C020EU

#define GPIO_98_GPIO98                  0x018C0400U
#define GPIO_98_ESC_GPI18               0x018C040AU
#define GPIO_98_SD1_C2                  0x018C040BU
#define GPIO_98_OUTPUTXBAR16            0x018C040EU

#define GPIO_99_GPIO99                  0x018C0600U
#define GPIO_99_EPWM8_A                 0x018C0601U
#define GPIO_99_EMIF1_DQM3              0x018C0602U
#define GPIO_99_EMIF1_D17               0x018C0603U
#define GPIO_99_ESC_GPI21               0x018C060AU
#define GPIO_99_SD4_D4                  0x018C060BU

#define GPIO_100_GPIO100                0x018C0800U
#define GPIO_100_EPWM9_A                0x018C0801U
#define GPIO_100_EMIF1_BA1              0x018C0802U
#define GPIO_100_EMIF1_D24              0x018C0803U
#define GPIO_100_SPIC_PICO              0x018C0805U
#define GPIO_100_SPIA_PICO              0x018C0806U
#define GPIO_100_SD1_D1                 0x018C0809U
#define GPIO_100_ESC_GPI0               0x018C080AU
#define GPIO_100_SD4_C4                 0x018C080BU
#define GPIO_100_FSITXA_D0              0x018C080DU
#define GPIO_100_FSIRXD_D1              0x018C080EU

