TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_101_GPIO101                0x018C0A00U
#define GPIO_101_EPWM18_A               0x018C0A01U
#define GPIO_101_EMIF1_A5               0x018C0A02U
#define GPIO_101_SPIC_POCI              0x018C0A05U
#define GPIO_101_ESC_GPI1               0x018C0A0AU
#define GPIO_101_FSITXA_D1              0x018C0A0DU

#define GPIO_103_GPIO103                0x018C0E00U
#define GPIO_103_EPWM8_B                0x018C0E01U
#define GPIO_103_EMIF1_BA0              0x018C0E02U
#define GPIO_103_EMIF1_D3               0x018C0E03U
#define GPIO_103_SPIC_PTE               0x018C0E05U
#define GPIO_103_ESC_GPI3               0x018C0E0AU
#define GPIO_103_SD4_C4                 0x018C0E0BU
#define GPIO_103_FSIRXA_D0              0x018C0E0DU
#define GPIO_103_ESC_GPO25              0x018C0E0FU

#define GPIO_105_GPIO105                0x018C1200U
#define GPIO_105_EPWM18_B               0x018C1201U
#define GPIO_105_I2CA_SCL               0x018C1205U
#define GPIO_105_ESC_GPI5               0x018C120AU
#define GPIO_105_SD3_C1                 0x018C120BU
#define GPIO_105_FSIRXA_CLK             0x018C120DU

#define GPIO_127_GPIO127                0x01901E00U
#define GPIO_127_EPWM18_A               0x01901E01U
#define GPIO_127_EMIF1_D18              0x01901E02U
#define GPIO_127_EMIF1_A11              0x01901E03U
#define GPIO_127_SPID_POCI              0x01901E05U
#define GPIO_127_ESC_GPI27              0x01901E0AU
#define GPIO_127_SD1_C3                 0x01901E0BU
#define GPIO_127_FSIRXC_D1              0x01901E0DU
#define GPIO_127_ESC_SYNC0              0x01901E0EU
#define GPIO_127_ESC_GPO26              0x01901E0FU

#define GPIO_219_GPIO219                0x03101600U
#define GPIO_219_ERRORSTS               0x03101601U
#define GPIO_219_EMIF1_A19              0x03101602U
#define GPIO_219_EPWM18_B               0x03101603U
#define GPIO_219_OUTPUTXBAR1            0x03101609U
#define GPIO_219_XCLKOUT                0x0310160AU
#define GPIO_219_SD2_C1                 0x0310160BU
#define GPIO_219_ESC_GPI8               0x0310160DU
#define GPIO_219_ESC_TX0_ENA            0x0310160EU
#define GPIO_219_ESC_GPO27              0x0310160FU

#define GPIO_220_GPIO220                0x03101800U
#define GPIO_220_EPWM6_A                0x03101801U
#define GPIO_220_EMIF1_A20              0x03101802U
#define GPIO_220_SPID_POCI              0x03101805U
#define GPIO_220_MCANC_TX               0x03101806U
#define GPIO_220_OUTPUTXBAR2            0x03101809U
#define GPIO_220_SD3_D3                 0x0310180BU
#define GPIO_220_ESC_GPI9               0x0310180DU
#define GPIO_220_ESC_GPO28              0x0310180FU

#define GPIO_221_GPIO221                0x03101A00U
#define GPIO_221_EPWM6_B                0x03101A01U
#define GPIO_221_EMIF1_A21              0x03101A02U
#define GPIO_221_EMIF1_CAS              0x03101A03U
#define GPIO_221_SPID_PTE               0x03101A05U
#define GPIO_221_MCANC_RX               0x03101A06U
#define GPIO_221_OUTPUTXBAR3            0x03101A09U
#define GPIO_221_SD3_C3                 0x03101A0BU
#define GPIO_221_ESC_GPI10              0x03101A0DU
#define GPIO_221_ESC_GPO29              0x03101A0FU

#define GPIO_222_GPIO222                0x03101C00U
#define GPIO_222_TDI                    0x03101C01U
#define GPIO_222_EPWM7_A                0x03101C02U
#define GPIO_222_SPID_PICO              0x03101C05U
#define GPIO_222_UARTB_TX               0x03101C06U
#define GPIO_222_I2CB_SCL               0x03101C07U
#define GPIO_222_OUTPUTXBAR4            0x03101C09U
#define GPIO_222_SPIC_CLK               0x03101C0AU
#define GPIO_222_SD3_D4                 0x03101C0BU
#define GPIO_222_ESC_GPI11              0x03101C0DU
#define GPIO_222_ESC_GPO30              0x03101C0FU

#define GPIO_223_GPIO223                0x03101E00U
#define GPIO_223_TDO                    0x03101E01U
#define GPIO_223_EPWM7_B                0x03101E02U
#define GPIO_223_SPID_CLK               0x03101E05U
#define GPIO_223_UARTB_RX               0x03101E06U
#define GPIO_223_I2CB_SDA               0x03101E07U
#define GPIO_223_OUTPUTXBAR5            0x03101E09U
#define GPIO_223_SPIC_PTE               0x03101E0AU
#define GPIO_223_SD3_C4                 0x03101E0BU
#define GPIO_223_ESC_GPI12              0x03101E0DU
#define GPIO_223_ESC_GPO31              0x03101E0FU

#define GPIO_160_AIO160                 0x028C0000U
#define GPIO_160_SD3_C2                 0x028C000BU

#define GPIO_161_AIO161                 0x028C0200U
#define GPIO_161_SD3_D2                 0x028C020BU

#define GPIO_162_AIO162                 0x028C0400U
#define GPIO_162_SD2_C2                 0x028C040BU

#define GPIO_163_AIO163                 0x028C0600U
#define GPIO_163_SD2_D2                 0x028C060BU

#define GPIO_164_AIO164                 0x028C0800U
#define GPIO_164_SD2_C3                 0x028C080BU

#define GPIO_165_AIO165                 0x028C0A00U
#define GPIO_165_SD2_D3                 0x028C0A0BU

#define GPIO_224_GPIO224                0x038C0000U
#define GPIO_224_EPWM12_A               0x038C0001U
#define GPIO_224_EPWM12_B               0x038C0002U
#define GPIO_224_SPIB_POCI              0x038C0005U
#define GPIO_224_MCAND_RX               0x038C0006U
#define GPIO_224_OUTPUTXBAR5            0x038C0009U
#define GPIO_224_SD4_D2                 0x038C000BU
#define GPIO_224_ADCA_EXTMUXSEL0        0x038C000EU
#define GPIO_224_ESC_GPO8               0x038C000FU

#define GPIO_225_GPIO225                0x038C0200U
#define GPIO_225_EPWM11_B               0x038C0201U
#define GPIO_225_SPIB_PICO              0x038C0205U
#define GPIO_225_I2CB_SDA               0x038C0206U
#define GPIO_225_UARTF_TX               0x038C0207U
#define GPIO_225_OUTPUTXBAR4            0x038C0209U
#define GPIO_225_SD4_C1                 0x038C020BU
#define GPIO_225_ADCA_EXTMUXSEL1        0x038C020EU
#define GPIO_225_ESC_GPO9               0x038C020FU

#define GPIO_226_GPIO226                0x038C0400U
#define GPIO_226_EPWM10_A               0x038C0401U
#define GPIO_226_SPIA_PTE               0x038C0405U
#define GPIO_226_MCAND_TX               0x038C0406U
#define GPIO_226_UARTF_RX               0x038C0407U
#define GPIO_226_OUTPUTXBAR1            0x038C0409U
#define GPIO_226_SD1_C3                 0x038C040AU
#define GPIO_226_SD1_D3                 0x038C040BU
#define GPIO_226_ADCA_EXTMUXSEL2        0x038C040EU
#define GPIO_226_ESC_GPO10              0x038C040FU

#define GPIO_227_GPIO227                0x038C0600U
#define GPIO_227_EPWM14_B               0x038C0601U
#define GPIO_227_SPIA_CLK               0x038C0605U
#define GPIO_227_OUTPUTXBAR4            0x038C0609U
#define GPIO_227_SD2_C2                 0x038C060BU
#define GPIO_227_ADCA_EXTMUXSEL3        0x038C060EU

#define GPIO_228_GPIO228                0x038C0800U
#define GPIO_228_EPWM18_A               0x038C0801U
#define GPIO_228_EPWM13_A               0x038C0802U
#define GPIO_228_SPIB_POCI              0x038C0805U
#define GPIO_228_LINB_TX                0x038C0806U
#define GPIO_228_OUTPUTXBAR1            0x038C0809U
#define GPIO_228_SENT4                  0x038C080AU
#define GPIO_228_SD2_D1                 0x038C080BU

#define GPIO_229_GPIO229                0x038C0A00U
#define GPIO_229_EPWM17_B               0x038C0A01U
#define GPIO_229_EPWM12_B               0x038C0A02U
#define GPIO_229_SPIB_PICO              0x038C0A05U
#define GPIO_229_MCANA_RX               0x038C0A06U
#define GPIO_229_SENT3                  0x038C0A0AU
#define GPIO_229_SD1_C4                 0x038C0A0BU

#define GPIO_166_AIO166                 0x028C0C00U
#define GPIO_166_SD4_C1                 0x028C0C0BU

#define GPIO_167_AIO167                 0x028C0E00U
#define GPIO_167_SD4_D1                 0x028C0E0BU

