TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_168_AIO168                 0x028C1000U
#define GPIO_168_SD3_C3                 0x028C100BU

#define GPIO_169_AIO169                 0x028C1200U
#define GPIO_169_SD3_D3                 0x028C120BU

#define GPIO_170_AIO170                 0x028C1400U
#define GPIO_170_SD3_C4                 0x028C140BU

#define GPIO_171_AIO171                 0x028C1600U
#define GPIO_171_SD3_D4                 0x028C160BU

#define GPIO_172_AIO172                 0x028C1800U
#define GPIO_172_SD1_C1                 0x028C180BU

#define GPIO_173_AIO173                 0x028C1A00U
#define GPIO_173_SD1_D1                 0x028C1A0BU

#define GPIO_174_AIO174                 0x028C1C00U
#define GPIO_174_SD2_C4                 0x028C1C0BU

#define GPIO_175_AIO175                 0x028C1E00U
#define GPIO_175_SD2_D4                 0x028C1E0BU

#define GPIO_230_GPIO230                0x038C0C00U
#define GPIO_230_EPWM11_A               0x038C0C01U
#define GPIO_230_SYNCOUT                0x038C0C03U
#define GPIO_230_I2CB_SCL               0x038C0C06U
#define GPIO_230_OUTPUTXBAR3            0x038C0C09U
#define GPIO_230_SD4_D1                 0x038C0C0BU
#define GPIO_230_ADCB_EXTMUXSEL0        0x038C0C0EU

#define GPIO_231_GPIO231                0x038C0E00U
#define GPIO_231_EPWM10_B               0x038C0E01U
#define GPIO_231_SPIA_PICO              0x038C0E05U
#define GPIO_231_MCAND_RX               0x038C0E06U
#define GPIO_231_OUTPUTXBAR2            0x038C0E09U
#define GPIO_231_SD1_C3                 0x038C0E0BU
#define GPIO_231_ADCB_EXTMUXSEL1        0x038C0E0EU

#define GPIO_232_GPIO232                0x038C1000U
#define GPIO_232_EPWM14_A               0x038C1001U
#define GPIO_232_EPWM8_B                0x038C1002U
#define GPIO_232_SPIA_POCI              0x038C1005U
#define GPIO_232_OUTPUTXBAR3            0x038C1009U
#define GPIO_232_SENT6                  0x038C100AU
#define GPIO_232_SD3_D1                 0x038C100BU
#define GPIO_232_ESC_PHY0_LINKSTATUS    0x038C100DU
#define GPIO_232_ADCB_EXTMUXSEL2        0x038C100EU
#define GPIO_232_ESC_GPO11              0x038C100FU

#define GPIO_233_GPIO233                0x038C1200U
#define GPIO_233_EPWM18_B               0x038C1201U
#define GPIO_233_EPWM13_B               0x038C1202U
#define GPIO_233_LINB_RX                0x038C1206U
#define GPIO_233_OUTPUTXBAR2            0x038C1209U
#define GPIO_233_SENT5                  0x038C120AU
#define GPIO_233_SD2_C1                 0x038C120BU
#define GPIO_233_ESC_PHY1_LINKSTATUS    0x038C120DU
#define GPIO_233_ADCB_EXTMUXSEL3        0x038C120EU
#define GPIO_233_ESC_GPO12              0x038C120FU

#define GPIO_234_GPIO234                0x038C1400U
#define GPIO_234_EPWM17_A               0x038C1401U
#define GPIO_234_EPWM12_A               0x038C1402U
#define GPIO_234_SPIB_PTE               0x038C1405U
#define GPIO_234_MCANA_TX               0x038C1406U
#define GPIO_234_SENT2                  0x038C140AU
#define GPIO_234_SD1_D4                 0x038C140BU
#define GPIO_234_ESC_GPO13              0x038C140FU

#define GPIO_235_GPIO235                0x038C1600U
#define GPIO_235_EPWM9_B                0x038C1601U
#define GPIO_235_SPIB_CLK               0x038C1605U
#define GPIO_235_MCANA_RX               0x038C1606U
#define GPIO_235_SENT1                  0x038C160AU
#define GPIO_235_SD1_C1                 0x038C160BU
#define GPIO_235_ESC_GPO14              0x038C160FU

#define GPIO_176_AIO176                 0x02900000U
#define GPIO_176_SD4_C2                 0x0290000BU

#define GPIO_177_AIO177                 0x02900200U
#define GPIO_177_SD4_D2                 0x0290020BU

#define GPIO_178_AIO178                 0x02900400U
#define GPIO_178_SD4_C3                 0x0290040BU

#define GPIO_179_AIO179                 0x02900600U
#define GPIO_179_SD4_D3                 0x0290060BU

#define GPIO_180_AIO180                 0x02900800U
#define GPIO_180_SD1_C2                 0x0290080BU

#define GPIO_181_AIO181                 0x02900A00U
#define GPIO_181_SD1_D2                 0x02900A0BU

#define GPIO_182_AIO182                 0x02900C00U
#define GPIO_182_SD3_C1                 0x02900C0BU

#define GPIO_183_AIO183                 0x02900E00U
#define GPIO_183_SD3_D1                 0x02900E0BU

#define GPIO_184_AIO184                 0x02901000U
#define GPIO_184_SD3_C2                 0x0290100BU

#define GPIO_185_AIO185                 0x02901200U
#define GPIO_185_SD3_D2                 0x0290120BU

#define GPIO_236_GPIO236                0x038C1800U
#define GPIO_236_EPWM12_B               0x038C1801U
#define GPIO_236_EPWM8_A                0x038C1802U
#define GPIO_236_LINA_RX                0x038C1806U
#define GPIO_236_OUTPUTXBAR6            0x038C1809U
#define GPIO_236_SD4_C2                 0x038C180BU
#define GPIO_236_ESC_I2C_SDA            0x038C180DU
#define GPIO_236_ADCC_EXTMUXSEL0        0x038C180EU

#define GPIO_237_GPIO237                0x038C1A00U
#define GPIO_237_EPWM14_A               0x038C1A01U
#define GPIO_237_EPWM8_B                0x038C1A02U
#define GPIO_237_EPWM17_B               0x038C1A03U
#define GPIO_237_LINA_TX                0x038C1A06U
#define GPIO_237_I2CA_SDA               0x038C1A07U
#define GPIO_237_OUTPUTXBAR7            0x038C1A09U
#define GPIO_237_SD4_D3                 0x038C1A0BU
#define GPIO_237_ESC_I2C_SCL            0x038C1A0DU
#define GPIO_237_ADCC_EXTMUXSEL1        0x038C1A0EU

#define GPIO_238_GPIO238                0x038C1C00U
#define GPIO_238_EPWM15_B               0x038C1C01U
#define GPIO_238_OUTPUTXBAR6            0x038C1C09U
#define GPIO_238_SD1_D3                 0x038C1C0AU
#define GPIO_238_SD2_C3                 0x038C1C0BU
#define GPIO_238_ESC_SYNC0              0x038C1C0DU
#define GPIO_238_ADCC_EXTMUXSEL2        0x038C1C0EU
#define GPIO_238_ESC_GPO15              0x038C1C0FU

#define GPIO_239_GPIO239                0x038C1E00U
#define GPIO_239_EPWM16_B               0x038C1E01U
#define GPIO_239_LINB_TX                0x038C1E06U
#define GPIO_239_I2CA_SCL               0x038C1E07U
#define GPIO_239_OUTPUTXBAR8            0x038C1E09U
#define GPIO_239_SD2_C4                 0x038C1E0BU
#define GPIO_239_ESC_SYNC1              0x038C1E0DU
#define GPIO_239_ADCC_EXTMUXSEL3        0x038C1E0EU
#define GPIO_239_ESC_GPO16              0x038C1E0FU

#define GPIO_186_AIO186                 0x02901400U
#define GPIO_186_SD1_C1                 0x0290140BU

