TexasInstruments/f29h85x-sdk/source/driverlib/pin_map.h
#define GPIO_187_AIO187                 0x02901600U
#define GPIO_187_SD1_D1                 0x0290160BU

#define GPIO_188_AIO188                 0x02901800U
#define GPIO_188_SD1_C2                 0x0290180BU

#define GPIO_189_AIO189                 0x02901A00U
#define GPIO_189_SD1_D2                 0x02901A0BU

#define GPIO_190_AIO190                 0x02901C00U
#define GPIO_190_SD1_C3                 0x02901C0BU

#define GPIO_191_AIO191                 0x02901E00U
#define GPIO_191_SD1_D3                 0x02901E0BU

#define GPIO_192_AIO192                 0x030C0000U
#define GPIO_192_SD1_C3                 0x030C000BU

#define GPIO_193_AIO193                 0x030C0200U
#define GPIO_193_SD1_D3                 0x030C020BU

#define GPIO_194_AIO194                 0x030C0400U
#define GPIO_194_SD1_C4                 0x030C040BU

#define GPIO_195_AIO195                 0x030C0600U
#define GPIO_195_SD1_D4                 0x030C060BU

#define GPIO_240_GPIO240                0x03900000U
#define GPIO_240_EPWM14_B               0x03900001U
#define GPIO_240_SPID_PICO              0x03900005U
#define GPIO_240_SD4_C3                 0x0390000BU
#define GPIO_240_ESC_LED_RUN            0x0390000DU
#define GPIO_240_ADCD_EXTMUXSEL0        0x0390000EU

#define GPIO_241_GPIO241                0x03900200U
#define GPIO_241_EPWM8_A                0x03900201U
#define GPIO_241_SPID_CLK               0x03900205U
#define GPIO_241_SD4_D4                 0x0390020BU
#define GPIO_241_ESC_LED_ERR            0x0390020DU
#define GPIO_241_ADCD_EXTMUXSEL1        0x0390020EU
#define GPIO_241_ESC_GPO17              0x0390020FU

#define GPIO_242_GPIO242                0x03900400U
#define GPIO_242_SD1_D4                 0x03900406U
#define GPIO_242_I2CA_SDA               0x03900407U
#define GPIO_242_OUTPUTXBAR9            0x03900409U
#define GPIO_242_SENT1                  0x0390040AU
#define GPIO_242_SD2_D2                 0x0390040BU
#define GPIO_242_ESC_LED_STATE_RUN      0x0390040DU
#define GPIO_242_ADCD_EXTMUXSEL2        0x0390040EU
#define GPIO_242_ESC_GPO18              0x0390040FU

#define GPIO_243_GPIO243                0x03900600U
#define GPIO_243_EPWM8_B                0x03900601U
#define GPIO_243_SENT2                  0x0390060AU
#define GPIO_243_SD2_D4                 0x0390060BU
#define GPIO_243_ESC_LED_LINK0_ACTIVE   0x0390060DU
#define GPIO_243_ADCD_EXTMUXSEL3        0x0390060EU
#define GPIO_243_ESC_GPO19              0x0390060FU

#define GPIO_244_GPIO244                0x03900800U
#define GPIO_244_SPIC_PTE               0x03900805U
#define GPIO_244_SENT5                  0x0390080AU
#define GPIO_244_SD4_C4                 0x0390080BU
#define GPIO_244_ESC_LED_LINK1_ACTIVE   0x0390080DU

#define GPIO_245_GPIO245                0x03900A00U
#define GPIO_245_SPIC_POCI              0x03900A05U
#define GPIO_245_SENT6                  0x03900A0AU
#define GPIO_245_SD3_C1                 0x03900A0BU
#define GPIO_245_ESC_PHY_RESETN         0x03900A0DU

#define GPIO_196_AIO196                 0x030C0800U
#define GPIO_196_SD4_C4                 0x030C080BU

#define GPIO_197_AIO197                 0x030C0A00U
#define GPIO_197_SD4_D4                 0x030C0A0BU

#define GPIO_198_AIO198                 0x030C0C00U
#define GPIO_198_SD1_C4                 0x030C0C0BU

#define GPIO_199_AIO199                 0x030C0E00U
#define GPIO_199_SD1_D4                 0x030C0E0BU

#define GPIO_200_AIO200                 0x030C1000U
#define GPIO_200_SD2_C1                 0x030C100BU

#define GPIO_201_AIO201                 0x030C1200U
#define GPIO_201_SD2_D1                 0x030C120BU

#define GPIO_202_AIO202                 0x030C1400U
#define GPIO_202_SD2_C1                 0x030C140BU

#define GPIO_203_AIO203                 0x030C1600U
#define GPIO_203_SD2_D1                 0x030C160BU

#define GPIO_204_AIO204                 0x030C1800U
#define GPIO_204_SD3_C3                 0x030C180BU

#define GPIO_205_AIO205                 0x030C1A00U
#define GPIO_205_SD3_D3                 0x030C1A0BU

#define GPIO_246_GPIO246                0x03900C00U
#define GPIO_246_EPWM16_A               0x03900C01U
#define GPIO_246_SPID_PTE               0x03900C05U
#define GPIO_246_MCANC_RX               0x03900C06U
#define GPIO_246_OUTPUTXBAR7            0x03900C09U
#define GPIO_246_SD1_D1                 0x03900C0BU
#define GPIO_246_ADCE_EXTMUXSEL0        0x03900C0EU
#define GPIO_246_ESC_GPO20              0x03900C0FU

#define GPIO_247_GPIO247                0x03900E00U
#define GPIO_247_EPWM15_A               0x03900E01U
#define GPIO_247_ERRORSTS               0x03900E02U
#define GPIO_247_SPID_POCI              0x03900E05U
#define GPIO_247_MCANC_RX               0x03900E06U
#define GPIO_247_LINA_TX                0x03900E07U
#define GPIO_247_OUTPUTXBAR5            0x03900E09U
#define GPIO_247_SD2_D3                 0x03900E0BU
#define GPIO_247_ADCE_EXTMUXSEL1        0x03900E0EU
#define GPIO_247_ESC_GPO21              0x03900E0FU

#define GPIO_248_GPIO248                0x03901000U
#define GPIO_248_EMIF1_SDCKE            0x03901002U
#define GPIO_248_SPIC_PICO              0x03901005U
#define GPIO_248_SENT3                  0x0390100AU
#define GPIO_248_SD1_C2                 0x0390100BU
#define GPIO_248_ESC_LED_RUN            0x0390100DU
#define GPIO_248_ADCE_EXTMUXSEL2        0x0390100EU
#define GPIO_248_ESC_GPO22              0x0390100FU

#define GPIO_249_GPIO249                0x03901200U
#define GPIO_249_SPIC_CLK               0x03901205U
#define GPIO_249_SENT4                  0x0390120AU
#define GPIO_249_SD1_D2                 0x0390120BU
#define GPIO_249_ESC_PHY0_LINKSTATUS    0x0390120DU
#define GPIO_249_ADCE_EXTMUXSEL3        0x0390120EU
#define GPIO_249_ESC_GPO23              0x0390120FU

#define GPIO_206_AIO206                 0x030C1C00U
#define GPIO_206_SD3_C4                 0x030C1C0BU

#define GPIO_207_AIO207                 0x030C1E00U
#define GPIO_207_SD3_D4                 0x030C1E0BU

#define GPIO_208_AIO208                 0x03100000U
#define GPIO_208_SD2_C2                 0x0310000BU

#define GPIO_209_AIO209                 0x03100200U
#define GPIO_209_SD2_D2                 0x0310020BU

#define GPIO_210_AIO210                 0x03100400U
#define GPIO_210_SD2_C3                 0x0310040BU

#define GPIO_211_AIO211                 0x03100600U
#define GPIO_211_SD2_D3                 0x0310060BU

#define GPIO_212_AIO212                 0x03100800U
#define GPIO_212_SD2_C4                 0x0310080BU

#define GPIO_213_AIO213                 0x03100A00U
#define GPIO_213_SD2_D4                 0x03100A0BU

#endif // PIN_MAP_H
